src/Catalogs/ШаблоныСоставныхБизнесПроцессов/ШаблоныСоставныхБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСоставныхБизнесПроцессов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОбработкаВходящегоДокументаПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
    <items>
      <name>ОбработкаИсходящегоДокументаПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
    <items>
      <name>ОбработкаВнутреннегоДокументаПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецШаблона</name>
    <type>
      <types>BusinessProcessRef.КомплексныйПроцесс</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьНаименованиеПредмета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйШаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСоставныхБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомплексныйПроцесс</name>
    <type>
      <types>BusinessProcessRef.КомплексныйПроцесс</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБизнесПроцесса</name>
    <comment>Описание поручения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияПроцесса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОтложенногоСтарта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПерсональныйШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонВКомплексномПроцессе</name>
    <comment>Показывает, что данный шаблон процесса используется в комплексном процессе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предметы</name>
    <attributes>
      <name>РольПредмета</name>
      <type>
        <types>EnumRef.РолиПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредмета</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредметаОснование</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>Предмет</name>
      <type>
        <types>CatalogRef.ТемыОбсуждений</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Проекты</types>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
        <types>CatalogRef.Файлы</types>
        <types>CatalogRef.ВходящиеДокументы</types>
        <types>DocumentRef.Бронь</types>
        <types>CatalogRef.ВнутренниеДокументы</types>
        <types>CatalogRef.СообщенияОбсуждений</types>
        <types>CatalogRef.ИсходящиеДокументы</types>
        <types>CatalogRef.Мероприятия</types>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонОснование</name>
      <type>
        <types>CatalogRef.ШаблоныИсходящихДокументов</types>
        <types>CatalogRef.Файлы</types>
        <types>String</types>
        <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
        <types>CatalogRef.ШаблоныВходящихДокументов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредметыЗадач</name>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>BusinessProcessRoutePointRef.ОбработкаВнутреннегоДокумента</types>
        <types>BusinessProcessRoutePointRef.ОбработкаИсходящегоДокумента</types>
        <types>BusinessProcessRoutePointRef.ОбработкаВходящегоДокумента</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредмета</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательноеЗаполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Шаблоны</name>
    <attributes>
      <name>Шаблон</name>
      <type>
        <types>CatalogRef.ШаблоныУтверждения</types>
        <types>CatalogRef.ШаблоныОзнакомления</types>
        <types>CatalogRef.ШаблоныРассмотрения</types>
        <types>CatalogRef.ШаблоныСогласования</types>
        <types>CatalogRef.ШаблоныПоручения</types>
        <types>CatalogRef.ШаблоныИсполнения</types>
        <types>CatalogRef.ШаблоныРегистрации</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/ШаблоныБизнесПроцессовКлиентСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// <Шаблоны бизнес процессов клиент сервер>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет, является ли ссылка на объект шаблоном процесса.
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на любой объект.
//
// Возвращаемое значение:
//  Булево - возвращает истину, если объект является шаблоном процесса.
//
Функция ЭтоШаблонПроцесса(СсылкаНаОбъект) Экспорт
	
	ТипОбъекта = ТипЗнч(СсылкаНаОбъект);
	
	ТипыШаблоновПроцессов = Новый Массив;
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныИсполнения"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныКомплексныхБизнесПроцессов"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныОзнакомления"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныПоручения"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныПриглашения"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныРассмотрения"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныРегистрации"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныСогласования"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныСоставныхБизнесПроцессов"));
	ТипыШаблоновПроцессов.Добавить(Тип("СправочникСсылка.ШаблоныУтверждения"));
	
	Возврат ТипыШаблоновПроцессов.Найти(ТипОбъекта) <> Неопределено;
	
КонецФункции

// Возвращает имена справочников шаблонов.
//
// Возвращаемое значение:
//  Массив
//
Функция ИменаСправочниковШаблонов() Экспорт
	
	ИменаСправочников = Новый Массив;
	ИменаСправочников.Добавить("ШаблоныИсполнения");
	ИменаСправочников.Добавить("ШаблоныКомплексныхБизнесПроцессов");
	ИменаСправочников.Добавить("ШаблоныОзнакомления");
	ИменаСправочников.Добавить("ШаблоныПриглашения");
	ИменаСправочников.Добавить("ШаблоныПоручения");
	ИменаСправочников.Добавить("ШаблоныРассмотрения");
	ИменаСправочников.Добавить("ШаблоныРегистрации");
	ИменаСправочников.Добавить("ШаблоныСогласования");
	ИменаСправочников.Добавить("ШаблоныСоставныхБизнесПроцессов");
	ИменаСправочников.Добавить("ШаблоныУтверждения");
	
	Возврат ИменаСправочников;
	
КонецФункции

// Возвращает шаблоны процессов по умолчанию.
//
// Возвращаемое значение:
//  Массив
//
Функция ШаблоныПроцессовПоУмолчанию() Экспорт
	
	ШаблоныПоУмолчанию = Новый Массив;
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныИсполнения.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныКомплексныхБизнесПроцессов.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныОзнакомления.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныПриглашения.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныРассмотрения.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныРегистрации.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныСогласования.ПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныСоставныхБизнесПроцессов.ОбработкаВнутреннегоДокументаПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныСоставныхБизнесПроцессов.ОбработкаВходящегоДокументаПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныСоставныхБизнесПроцессов.ОбработкаИсходящегоДокументаПоУмолчанию"));
	
	ШаблоныПоУмолчанию.Добавить(
		ПредопределенноеЗначение("Справочник.ШаблоныУтверждения.ПоУмолчанию"));
	
	Возврат ШаблоныПоУмолчанию;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс_ДоступностьШаблоновПроцессов

// Обновляет видимость группы доступности в карточке шаблона.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - карточка шаблона процесса.
//
Процедура ОбновитьОтображениеГруппыДоступности(Форма) Экспорт
	
	Форма.Элементы.ГруппаДоступностьШаблона.Видимость = 
		ЗначениеЗаполнено(Форма.Объект.Ссылка) И Не Форма.ЭтоДействиеКомплексногоПроцесса;
	
КонецПроцедуры

// Обновляет отображение признака доступности шаблона процесса в карточке.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - карточка шаблона процесса.
//
Процедура ОбновитьОтображениеДоступностиШаблона(Форма) Экспорт
	
	Если Не Форма.ДоступенРучнойЗапускПоШаблону И Не Форма.ДоступенАвтоматическийЗапускПоШаблону Тогда
		Форма.Элементы.ГруппаДоступностьШаблонаСтраницы.ТекущаяСтраница = 
			Форма.Элементы.ГруппаШаблонНедоступенЗапуска;
	ИначеЕсли Форма.ДоступенРучнойЗапускПоШаблону И Не Форма.ДоступенАвтоматическийЗапускПоШаблону Тогда
		Форма.Элементы.ГруппаДоступностьШаблонаСтраницы.ТекущаяСтраница = 
			Форма.Элементы.ГруппаРучнойЗапуск;
	Иначе
		Форма.Элементы.ГруппаДоступностьШаблонаСтраницы.ТекущаяСтраница = 
			Форма.Элементы.ГруппаРучнойИАвтоматическийЗапуск;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
